99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ledc/esp32_mquickjs_ledc.c
#include "esp32_mquickjs_ledc.h"

#if CONFIG_ESP32_MQUICKJS_FEATURE_LEDC

#include "esp32_mquickjs_core.h"

#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "driver/gpio.h"
#include "driver/ledc.h"
#include "esp_err.h"
#include "soc/soc_caps.h"

typedef struct {
    bool configured;
    bool paused;
    uint32_t freq_hz;
    ledc_timer_bit_t duty_resolution;
    ledc_clk_cfg_t clock;
} esp32_mquickjs_ledc_timer_state_t;

typedef struct {
    bool configured;
    int pin;
    ledc_timer_t timer;
    uint32_t duty;
    uint32_t hpoint;
    bool output_invert;
    ledc_sleep_mode_t sleep_mode;
} esp32_mquickjs_ledc_channel_state_t;

static esp32_mquickjs_ledc_timer_state_t s_ledc_timers[SOC_LEDC_TIMER_NUM];
static esp32_mquickjs_ledc_channel_state_t s_ledc_channels[SOC_LEDC_CHANNEL_NUM];
static bool s_ledc_fade_service_installed;
static bool s_ledc_fade_service_owned;

static int js_value_to_u32(JSContext *ctx, JSValue value, uint32_t *out_value)
{
    int raw_value = 0;

    if (JS_ToInt32(ctx, &raw_value, value) != 0 || raw_value < 0) {
        return -1;
    }

    *out_value = (uint32_t)raw_value;
    return 0;
}

static int js_value_to_bool(JSContext *ctx, JSValue value, bool *out_value)
{
    int raw_value = 0;

    if (JS_IsBool(value)) {
        *out_value = (value == JS_TRUE);
        return 0;
    }

    if (JS_ToInt32(ctx, &raw_value, value) != 0) {
        return -1;
    }

    *out_value = raw_value != 0;
    return 0;
}

static int js_value_to_timer(JSContext *ctx, JSValue value, ledc_timer_t *out_timer)
{
    int timer = -1;

    if (JS_ToInt32(ctx, &timer, value) != 0 || timer < 0 || timer >= SOC_LEDC_TIMER_NUM) {
        return -1;
    }

    *out_timer = (ledc_timer_t)timer;
    return 0;
}

static int js_value_to_channel(JSContext *ctx, JSValue value, ledc_channel_t *out_channel)
{
    int channel = -1;

    if (JS_ToInt32(ctx, &channel, value) != 0 || channel < 0 || channel >= SOC_LEDC_CHANNEL_NUM) {
        return -1;
    }

    *out_channel = (ledc_channel_t)channel;
    return 0;
}

static int js_value_to_gpio_num(JSContext *ctx, JSValue value, gpio_num_t *out_pin)
{
    int pin = -1;

    if (JS_ToInt32(ctx, &pin, value) != 0 ||
        pin < 0 ||
        pin >= GPIO_NUM_MAX ||
        !GPIO_IS_VALID_OUTPUT_GPIO(pin)) {
        return -1;
    }

    *out_pin = (gpio_num_t)pin;
    return 0;
}

static int js_value_to_duty_resolution(JSContext *ctx, JSValue value, ledc_timer_bit_t *out_resolution)
{
    int bits = 0;

    if (JS_ToInt32(ctx, &bits, value) != 0 ||
        bits < LEDC_TIMER_1_BIT ||
        bits > SOC_LEDC_TIMER_BIT_WIDTH) {
        return -1;
    }

    *out_resolution = (ledc_timer_bit_t)bits;
    return 0;
}

static const char *ledc_clock_to_string(ledc_clk_cfg_t clock)
{
    if (clock == LEDC_AUTO_CLK) {
        return "auto";
    }
#if SOC_LEDC_SUPPORT_APB_CLOCK
    if (clock == LEDC_USE_APB_CLK) {
        return "apb";
    }
#endif
#if SOC_LEDC_SUPPORT_XTAL_CLOCK
    if (clock == LEDC_USE_XTAL_CLK) {
        return "xtal";
    }
#endif
    if (clock == LEDC_USE_RC_FAST_CLK) {
        return "rcFast";
    }
    return "auto";
}

static int ledc_clock_from_string(const char *clock_name, ledc_clk_cfg_t *out_clock)
{
    if (strcmp(clock_name, "auto") == 0) {
        *out_clock = LEDC_AUTO_CLK;
        return 0;
    }
#if SOC_LEDC_SUPPORT_APB_CLOCK
    if (strcmp(clock_name, "apb") == 0) {
        *out_clock = LEDC_USE_APB_CLK;
        return 0;
    }
#endif
#if SOC_LEDC_SUPPORT_XTAL_CLOCK
    if (strcmp(clock_name, "xtal") == 0) {
        *out_clock = LEDC_USE_XTAL_CLK;
        return 0;
    }
#endif
    if (strcmp(clock_name, "rcFast") == 0 || strcmp(clock_name, "rc_fast") == 0) {
        *out_clock = LEDC_USE_RC_FAST_CLK;
        return 0;
    }

    return -1;
}

static const char *ledc_sleep_mode_to_string(ledc_sleep_mode_t sleep_mode)
{
    if (sleep_mode == LEDC_SLEEP_MODE_NO_ALIVE_ALLOW_PD) {
        return "noAliveAllowPd";
    }
    if (sleep_mode == LEDC_SLEEP_MODE_KEEP_ALIVE) {
        return "keepAlive";
    }
    return "noAliveNoPd";
}

static int ledc_sleep_mode_from_string(const char *sleep_mode, ledc_sleep_mode_t *out_sleep_mode)
{
    if (strcmp(sleep_mode, "noAliveNoPd") == 0 || strcmp(sleep_mode, "no_alive_no_pd") == 0) {
        *out_sleep_mode = LEDC_SLEEP_MODE_NO_ALIVE_NO_PD;
        return 0;
    }
    if (strcmp(sleep_mode, "noAliveAllowPd") == 0 || strcmp(sleep_mode, "no_alive_allow_pd") == 0) {
        *out_sleep_mode = LEDC_SLEEP_MODE_NO_ALIVE_ALLOW_PD;
        return 0;
    }
    if (strcmp(sleep_mode, "keepAlive") == 0 || strcmp(sleep_mode, "keep_alive") == 0) {
        *out_sleep_mode = LEDC_SLEEP_MODE_KEEP_ALIVE;
        return 0;
    }

    return -1;
}

static uint32_t ledc_resolution_to_max_duty(ledc_timer_bit_t duty_resolution)
{
    if (duty_resolution <= 0 || duty_resolution >= 31) {
        return 0;
    }
    return (1u << duty_resolution) - 1u;
}

static esp32_mquickjs_ledc_timer_state_t *ledc_timer_state(ledc_timer_t timer)
{
    return &s_ledc_timers[(int)timer];
}

static esp32_mquickjs_ledc_channel_state_t *ledc_channel_state(ledc_channel_t channel)
{
    return &s_ledc_channels[(int)channel];
}

static JSValue ledc_throw_error(JSContext *ctx,
                                esp_err_t err,
                                const char *api_name,
                                int index)
{
    return JS_ThrowInternalError(ctx, "%s(%d) failed: %s", api_name, index, esp_err_to_name(err));
}

static bool ledc_ensure_fade_service(JSContext *ctx)
{
    esp_err_t err;

    if (s_ledc_fade_service_installed) {
        return true;
    }

    err = ledc_fade_func_install(0);
    if (err == ESP_OK) {
        s_ledc_fade_service_installed = true;
        s_ledc_fade_service_owned = true;
        return true;
    }
    if (err == ESP_ERR_INVALID_STATE) {
        s_ledc_fade_service_installed = true;
        s_ledc_fade_service_owned = false;
        return true;
    }

    JS_ThrowInternalError(ctx, "ledc_fade_func_install() failed: %s", esp_err_to_name(err));
    return false;
}

static JSValue ledc_make_timer_status(JSContext *ctx, ledc_timer_t timer)
{
    esp32_mquickjs_ledc_timer_state_t *state = ledc_timer_state(timer);
    JSGCRef status_ref;
    JSValue *status_obj;
    uint32_t freq_hz = state->configured ? ledc_get_freq(LEDC_LOW_SPEED_MODE, timer) : 0;

