99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ledc/esp32_mquickjs_ledc.c
    if (state->configured && freq_hz != 0) {
        state->freq_hz = freq_hz;
    }

    status_obj = JS_PushGCRef(ctx, &status_ref);
    *status_obj = JS_NewObject(ctx);
    if (JS_IsException(*status_obj)) {
        JS_PopGCRef(ctx, &status_ref);
        return JS_EXCEPTION;
    }

    if (!esp32_mquickjs_set_property(ctx, *status_obj, "timer", JS_NewInt32(ctx, (int32_t)timer)) ||
        !esp32_mquickjs_set_property(ctx, *status_obj, "configured", JS_NewBool(state->configured)) ||
        !esp32_mquickjs_set_property(ctx, *status_obj, "paused", JS_NewBool(state->paused)) ||
        !esp32_mquickjs_set_property(ctx, *status_obj, "freqHz", JS_NewUint32(ctx, state->configured ? state->freq_hz : 0)) ||
        !esp32_mquickjs_set_property(ctx, *status_obj, "dutyResolution",
                                     JS_NewInt32(ctx, state->configured ? (int32_t)state->duty_resolution : 0)) ||
        !esp32_mquickjs_set_property(ctx, *status_obj, "maxDuty",
                                     JS_NewUint32(ctx, state->configured
                                                           ? ledc_resolution_to_max_duty(state->duty_resolution)
                                                           : 0)) ||
        !esp32_mquickjs_set_property(ctx, *status_obj, "clock",
                                     JS_NewString(ctx, ledc_clock_to_string(state->clock)))) {
        JS_PopGCRef(ctx, &status_ref);
        return JS_EXCEPTION;
    }

    return JS_PopGCRef(ctx, &status_ref);
}

static JSValue ledc_make_channel_status(JSContext *ctx, ledc_channel_t channel)
{
    esp32_mquickjs_ledc_channel_state_t *state = ledc_channel_state(channel);
    esp32_mquickjs_ledc_timer_state_t *timer_state = state->configured ? ledc_timer_state(state->timer) : NULL;
    JSGCRef status_ref;
    JSValue *status_obj;

    status_obj = JS_PushGCRef(ctx, &status_ref);
    *status_obj = JS_NewObject(ctx);
    if (JS_IsException(*status_obj)) {
        JS_PopGCRef(ctx, &status_ref);
        return JS_EXCEPTION;
    }

    if (!esp32_mquickjs_set_property(ctx, *status_obj, "channel", JS_NewInt32(ctx, (int32_t)channel)) ||
        !esp32_mquickjs_set_property(ctx, *status_obj, "configured", JS_NewBool(state->configured)) ||
        !esp32_mquickjs_set_property(ctx, *status_obj, "pin", JS_NewInt32(ctx, (int32_t)state->pin)) ||
        !esp32_mquickjs_set_property(ctx, *status_obj, "timer",
                                     JS_NewInt32(ctx, state->configured ? (int32_t)state->timer : -1)) ||
        !esp32_mquickjs_set_property(ctx, *status_obj, "duty",
                                     JS_NewUint32(ctx, state->configured ? state->duty : 0)) ||
        !esp32_mquickjs_set_property(ctx, *status_obj, "hpoint",
                                     JS_NewUint32(ctx, state->configured ? state->hpoint : 0)) ||
        !esp32_mquickjs_set_property(ctx, *status_obj, "maxDuty",
                                     JS_NewUint32(ctx, state->configured && timer_state != NULL && timer_state->configured
                                                           ? ledc_resolution_to_max_duty(timer_state->duty_resolution)
                                                           : 0)) ||
        !esp32_mquickjs_set_property(ctx, *status_obj, "outputInvert",
                                     JS_NewBool(state->configured && state->output_invert)) ||
        !esp32_mquickjs_set_property(ctx, *status_obj, "sleepMode",
                                     JS_NewString(ctx, ledc_sleep_mode_to_string(state->sleep_mode)))) {
        JS_PopGCRef(ctx, &status_ref);
        return JS_EXCEPTION;
    }

    return JS_PopGCRef(ctx, &status_ref);
}

static bool ledc_read_bool_option(JSContext *ctx,
                                  JSValue options,
                                  const char *name,
                                  bool *out_value)
{
    JSValue property = JS_GetPropertyStr(ctx, options, name);

    if (JS_IsException(property)) {
        return false;
    }
    if (JS_IsUndefined(property) || JS_IsNull(property)) {
        return true;
    }
    if (js_value_to_bool(ctx, property, out_value) != 0) {
        JS_ThrowTypeError(ctx, "ledc.%s expects a boolean-like value", name);
        return false;
    }
    return true;
}

void esp32_mquickjs_deinit_ledc_runtime(void)
{
    for (size_t i = 0; i < SOC_LEDC_CHANNEL_NUM; ++i) {
        if (s_ledc_channels[i].configured) {
            ledc_channel_config_t config = {
                .speed_mode = LEDC_LOW_SPEED_MODE,
                .channel = (ledc_channel_t)i,
                .deconfigure = true,
            };

            (void)ledc_stop(LEDC_LOW_SPEED_MODE, (ledc_channel_t)i, 0);
            (void)ledc_channel_config(&config);
        }
    }
    for (size_t i = 0; i < SOC_LEDC_TIMER_NUM; ++i) {
        if (s_ledc_timers[i].configured) {
            ledc_timer_config_t config = {
                .speed_mode = LEDC_LOW_SPEED_MODE,
                .timer_num = (ledc_timer_t)i,
                .deconfigure = true,
            };

            (void)ledc_timer_pause(LEDC_LOW_SPEED_MODE, (ledc_timer_t)i);
            (void)ledc_timer_config(&config);
        }
    }
    if (s_ledc_fade_service_owned) {
        ledc_fade_func_uninstall();
    }

    memset(s_ledc_timers, 0, sizeof(s_ledc_timers));
    memset(s_ledc_channels, 0, sizeof(s_ledc_channels));
    s_ledc_fade_service_installed = false;
    s_ledc_fade_service_owned = false;

    for (size_t i = 0; i < SOC_LEDC_CHANNEL_NUM; ++i) {
        s_ledc_channels[i].pin = -1;
        s_ledc_channels[i].timer = (ledc_timer_t)-1;
        s_ledc_channels[i].sleep_mode = LEDC_SLEEP_MODE_NO_ALIVE_NO_PD;
    }
    for (size_t i = 0; i < SOC_LEDC_TIMER_NUM; ++i) {
        s_ledc_timers[i].clock = LEDC_AUTO_CLK;
    }
}

void esp32_mquickjs_init_ledc_runtime(void)
{
    esp32_mquickjs_deinit_ledc_runtime();
}

JSValue js_ledc_timerConfig(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    ledc_timer_t timer;
    bool deconfigure = false;
    uint32_t freq_hz = 0;
    ledc_timer_bit_t duty_resolution = LEDC_TIMER_8_BIT;
    ledc_clk_cfg_t clock = LEDC_AUTO_CLK;
    ledc_timer_config_t config = {0};
    esp_err_t err;

    (void)this_val;

    if (argc < 2 || js_value_to_timer(ctx, argv[0], &timer) != 0 || JS_GetClassID(ctx, argv[1]) < 0) {
        return JS_ThrowTypeError(ctx,
                                 "ledc.timerConfig(timer, options) expects a timer index and an options object");
    }

    if (!ledc_read_bool_option(ctx, argv[1], "deconfigure", &deconfigure)) {
        return JS_EXCEPTION;
    }

    config.speed_mode = LEDC_LOW_SPEED_MODE;
    config.timer_num = timer;
    config.deconfigure = deconfigure;

    if (!deconfigure) {
        JSValue property = JS_GetPropertyStr(ctx, argv[1], "freqHz");
        if (JS_IsException(property) || js_value_to_u32(ctx, property, &freq_hz) != 0 || freq_hz == 0) {
            return JS_ThrowTypeError(ctx, "ledc.timerConfig({ freqHz }) expects a positive integer");
        }

        property = JS_GetPropertyStr(ctx, argv[1], "dutyResolution");
        if (JS_IsException(property) || js_value_to_duty_resolution(ctx, property, &duty_resolution) != 0) {
            return JS_ThrowTypeError(ctx, "ledc.timerConfig({ dutyResolution }) expects 1..%d", SOC_LEDC_TIMER_BIT_WIDTH);
        }

        property = JS_GetPropertyStr(ctx, argv[1], "clock");
        if (JS_IsException(property)) {
            return JS_EXCEPTION;
        }
        if (!JS_IsUndefined(property) && !JS_IsNull(property)) {
            JSCStringBuf clock_buf;
            const char *clock_name = JS_ToCString(ctx, property, &clock_buf);

            if (clock_name == NULL || ledc_clock_from_string(clock_name, &clock) != 0) {
                return JS_ThrowTypeError(ctx,
                                         "ledc.timerConfig({ clock }) expects \"auto\", \"apb\", \"xtal\", or \"rcFast\"");
            }
        }

        config.freq_hz = freq_hz;
        config.duty_resolution = duty_resolution;
        config.clk_cfg = clock;
    } else if (ledc_timer_state(timer)->configured) {
        (void)ledc_timer_pause(LEDC_LOW_SPEED_MODE, timer);
    }

    err = ledc_timer_config(&config);
    if (err != ESP_OK) {
        return ledc_throw_error(ctx, err, "ledc_timer_config", (int)timer);
    }

