99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ledc/esp32_mquickjs_ledc.c
    if (deconfigure) {
        memset(ledc_timer_state(timer), 0, sizeof(*ledc_timer_state(timer)));
        ledc_timer_state(timer)->clock = LEDC_AUTO_CLK;
    } else {
        ledc_timer_state(timer)->configured = true;
        ledc_timer_state(timer)->paused = false;
        ledc_timer_state(timer)->freq_hz = freq_hz;
        ledc_timer_state(timer)->duty_resolution = duty_resolution;
        ledc_timer_state(timer)->clock = clock;
    }

    return ledc_make_timer_status(ctx, timer);
}

JSValue js_ledc_channelConfig(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    ledc_channel_t channel;
    bool deconfigure = false;
    gpio_num_t pin = GPIO_NUM_NC;
    ledc_timer_t timer = LEDC_TIMER_0;
    uint32_t duty = 0;
    uint32_t hpoint = 0;
    bool output_invert = false;
    ledc_sleep_mode_t sleep_mode = LEDC_SLEEP_MODE_NO_ALIVE_NO_PD;
    ledc_channel_config_t config = {0};
    esp_err_t err;

    (void)this_val;

    if (argc < 2 || js_value_to_channel(ctx, argv[0], &channel) != 0 || JS_GetClassID(ctx, argv[1]) < 0) {
        return JS_ThrowTypeError(ctx,
                                 "ledc.channelConfig(channel, options) expects a channel index and an options object");
    }

    if (!ledc_read_bool_option(ctx, argv[1], "deconfigure", &deconfigure)) {
        return JS_EXCEPTION;
    }

    config.speed_mode = LEDC_LOW_SPEED_MODE;
    config.channel = channel;
    config.deconfigure = deconfigure;

    if (!deconfigure) {
        JSValue property = JS_GetPropertyStr(ctx, argv[1], "pin");
        if (JS_IsException(property) || js_value_to_gpio_num(ctx, property, &pin) != 0) {
            return JS_ThrowTypeError(ctx, "ledc.channelConfig({ pin }) expects an output-capable GPIO");
        }

        property = JS_GetPropertyStr(ctx, argv[1], "timer");
        if (JS_IsException(property) || js_value_to_timer(ctx, property, &timer) != 0) {
            return JS_ThrowTypeError(ctx, "ledc.channelConfig({ timer }) expects a valid timer index");
        }

        property = JS_GetPropertyStr(ctx, argv[1], "duty");
        if (JS_IsException(property)) {
            return JS_EXCEPTION;
        }
        if (!JS_IsUndefined(property) && !JS_IsNull(property)) {
            if (js_value_to_u32(ctx, property, &duty) != 0) {
                return JS_ThrowTypeError(ctx, "ledc.channelConfig({ duty }) expects a non-negative integer");
            }
        }

        property = JS_GetPropertyStr(ctx, argv[1], "hpoint");
        if (JS_IsException(property)) {
            return JS_EXCEPTION;
        }
        if (!JS_IsUndefined(property) && !JS_IsNull(property)) {
            if (js_value_to_u32(ctx, property, &hpoint) != 0) {
                return JS_ThrowTypeError(ctx, "ledc.channelConfig({ hpoint }) expects a non-negative integer");
            }
        }

        if (!ledc_read_bool_option(ctx, argv[1], "outputInvert", &output_invert)) {
            return JS_EXCEPTION;
        }

        property = JS_GetPropertyStr(ctx, argv[1], "sleepMode");
        if (JS_IsException(property)) {
            return JS_EXCEPTION;
        }
        if (!JS_IsUndefined(property) && !JS_IsNull(property)) {
            JSCStringBuf sleep_buf;
            const char *sleep_name = JS_ToCString(ctx, property, &sleep_buf);

            if (sleep_name == NULL || ledc_sleep_mode_from_string(sleep_name, &sleep_mode) != 0) {
                return JS_ThrowTypeError(ctx,
                                         "ledc.channelConfig({ sleepMode }) expects \"noAliveNoPd\", \"noAliveAllowPd\", or \"keepAlive\"");
            }
        }

        config.gpio_num = pin;
        config.timer_sel = timer;
        config.duty = duty;
        config.hpoint = (int)hpoint;
        config.sleep_mode = sleep_mode;
        config.flags.output_invert = output_invert ? 1U : 0U;
    }

    err = ledc_channel_config(&config);
    if (err != ESP_OK) {
        return ledc_throw_error(ctx, err, "ledc_channel_config", (int)channel);
    }

    if (deconfigure) {
        memset(ledc_channel_state(channel), 0, sizeof(*ledc_channel_state(channel)));
        ledc_channel_state(channel)->pin = -1;
        ledc_channel_state(channel)->timer = (ledc_timer_t)-1;
        ledc_channel_state(channel)->sleep_mode = LEDC_SLEEP_MODE_NO_ALIVE_NO_PD;
    } else {
        ledc_channel_state(channel)->configured = true;
        ledc_channel_state(channel)->pin = (int)pin;
        ledc_channel_state(channel)->timer = timer;
        ledc_channel_state(channel)->duty = duty;
        ledc_channel_state(channel)->hpoint = hpoint;
        ledc_channel_state(channel)->output_invert = output_invert;
        ledc_channel_state(channel)->sleep_mode = sleep_mode;
    }

    return ledc_make_channel_status(ctx, channel);
}

JSValue js_ledc_setDuty(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    ledc_channel_t channel;
    uint32_t duty = 0;
    esp_err_t err;

    (void)this_val;

    if (argc < 2 || js_value_to_channel(ctx, argv[0], &channel) != 0 || js_value_to_u32(ctx, argv[1], &duty) != 0) {
        return JS_ThrowTypeError(ctx, "ledc.setDuty(channel, duty) expects a channel index and a non-negative duty");
    }

    err = ledc_set_duty(LEDC_LOW_SPEED_MODE, channel, duty);
    if (err != ESP_OK) {
        return ledc_throw_error(ctx, err, "ledc_set_duty", (int)channel);
    }

    ledc_channel_state(channel)->duty = duty;
    return ledc_make_channel_status(ctx, channel);
}

JSValue js_ledc_setDutyWithHpoint(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    ledc_channel_t channel;
    uint32_t duty = 0;
    uint32_t hpoint = 0;
    esp_err_t err;

    (void)this_val;

    if (argc < 3 ||
        js_value_to_channel(ctx, argv[0], &channel) != 0 ||
        js_value_to_u32(ctx, argv[1], &duty) != 0 ||
        js_value_to_u32(ctx, argv[2], &hpoint) != 0) {
        return JS_ThrowTypeError(ctx,
                                 "ledc.setDutyWithHpoint(channel, duty, hpoint) expects non-negative integers");
    }

    err = ledc_set_duty_with_hpoint(LEDC_LOW_SPEED_MODE, channel, duty, hpoint);
    if (err != ESP_OK) {
        return ledc_throw_error(ctx, err, "ledc_set_duty_with_hpoint", (int)channel);
    }

    ledc_channel_state(channel)->duty = duty;
    ledc_channel_state(channel)->hpoint = hpoint;
    return ledc_make_channel_status(ctx, channel);
}

JSValue js_ledc_setDutyAndUpdate(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    ledc_channel_t channel;
    uint32_t duty = 0;
    uint32_t hpoint = 0;
    esp_err_t err;

    (void)this_val;

    if (argc < 2 ||
        js_value_to_channel(ctx, argv[0], &channel) != 0 ||
        js_value_to_u32(ctx, argv[1], &duty) != 0) {
        return JS_ThrowTypeError(ctx, "ledc.setDutyAndUpdate(channel, duty, hpoint?) expects numeric arguments");
    }

    if (argc >= 3 && !JS_IsUndefined(argv[2]) && !JS_IsNull(argv[2]) && js_value_to_u32(ctx, argv[2], &hpoint) != 0) {
        return JS_ThrowTypeError(ctx, "ledc.setDutyAndUpdate(channel, duty, hpoint?) expects a non-negative hpoint");
    }
    if (!ledc_ensure_fade_service(ctx)) {
        return JS_EXCEPTION;
    }

    err = ledc_set_duty_and_update(LEDC_LOW_SPEED_MODE, channel, duty, hpoint);
    if (err != ESP_OK) {
        return ledc_throw_error(ctx, err, "ledc_set_duty_and_update", (int)channel);
    }

    ledc_channel_state(channel)->duty = duty;
    ledc_channel_state(channel)->hpoint = hpoint;
    return ledc_make_channel_status(ctx, channel);
}

