99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ledc/esp32_mquickjs_ledc.c
JSValue js_ledc_getDuty(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    ledc_channel_t channel;
    uint32_t duty;

    (void)this_val;

    if (argc < 1 || js_value_to_channel(ctx, argv[0], &channel) != 0) {
        return JS_ThrowTypeError(ctx, "ledc.getDuty(channel) expects a channel index");
    }

    duty = ledc_get_duty(LEDC_LOW_SPEED_MODE, channel);
    if (duty == LEDC_ERR_DUTY) {
        return JS_ThrowInternalError(ctx, "ledc.getDuty(%d) failed", (int)channel);
    }

    ledc_channel_state(channel)->duty = duty;
    return JS_NewUint32(ctx, duty);
}

JSValue js_ledc_getHpoint(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    ledc_channel_t channel;
    int hpoint;

    (void)this_val;

    if (argc < 1 || js_value_to_channel(ctx, argv[0], &channel) != 0) {
        return JS_ThrowTypeError(ctx, "ledc.getHpoint(channel) expects a channel index");
    }

    hpoint = ledc_get_hpoint(LEDC_LOW_SPEED_MODE, channel);
    if (hpoint == LEDC_ERR_VAL) {
        return JS_ThrowInternalError(ctx, "ledc.getHpoint(%d) failed", (int)channel);
    }

    ledc_channel_state(channel)->hpoint = (uint32_t)hpoint;
    return JS_NewInt32(ctx, hpoint);
}

JSValue js_ledc_updateDuty(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    ledc_channel_t channel;
    esp_err_t err;

    (void)this_val;

    if (argc < 1 || js_value_to_channel(ctx, argv[0], &channel) != 0) {
        return JS_ThrowTypeError(ctx, "ledc.updateDuty(channel) expects a channel index");
    }

    err = ledc_update_duty(LEDC_LOW_SPEED_MODE, channel);
    if (err != ESP_OK) {
        return ledc_throw_error(ctx, err, "ledc_update_duty", (int)channel);
    }

    return ledc_make_channel_status(ctx, channel);
}

JSValue js_ledc_setFreq(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    ledc_timer_t timer;
    uint32_t freq_hz = 0;
    esp_err_t err;

    (void)this_val;

    if (argc < 2 || js_value_to_timer(ctx, argv[0], &timer) != 0 || js_value_to_u32(ctx, argv[1], &freq_hz) != 0 || freq_hz == 0) {
        return JS_ThrowTypeError(ctx, "ledc.setFreq(timer, freqHz) expects a timer index and a positive frequency");
    }

    err = ledc_set_freq(LEDC_LOW_SPEED_MODE, timer, freq_hz);
    if (err != ESP_OK) {
        return ledc_throw_error(ctx, err, "ledc_set_freq", (int)timer);
    }

    ledc_timer_state(timer)->configured = true;
    ledc_timer_state(timer)->freq_hz = freq_hz;
    return ledc_make_timer_status(ctx, timer);
}

JSValue js_ledc_getFreq(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    ledc_timer_t timer;
    uint32_t freq_hz;

    (void)this_val;

    if (argc < 1 || js_value_to_timer(ctx, argv[0], &timer) != 0) {
        return JS_ThrowTypeError(ctx, "ledc.getFreq(timer) expects a timer index");
    }

    freq_hz = ledc_get_freq(LEDC_LOW_SPEED_MODE, timer);
    if (freq_hz == 0) {
        return JS_ThrowInternalError(ctx, "ledc.getFreq(%d) failed", (int)timer);
    }

    ledc_timer_state(timer)->configured = true;
    ledc_timer_state(timer)->freq_hz = freq_hz;
    return JS_NewUint32(ctx, freq_hz);
}

JSValue js_ledc_bindChannelTimer(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    ledc_channel_t channel;
    ledc_timer_t timer;
    esp_err_t err;

    (void)this_val;

    if (argc < 2 || js_value_to_channel(ctx, argv[0], &channel) != 0 || js_value_to_timer(ctx, argv[1], &timer) != 0) {
        return JS_ThrowTypeError(ctx, "ledc.bindChannelTimer(channel, timer) expects valid indices");
    }

    err = ledc_bind_channel_timer(LEDC_LOW_SPEED_MODE, channel, timer);
    if (err != ESP_OK) {
        return ledc_throw_error(ctx, err, "ledc_bind_channel_timer", (int)channel);
    }

    ledc_channel_state(channel)->configured = true;
    ledc_channel_state(channel)->timer = timer;
    return ledc_make_channel_status(ctx, channel);
}

JSValue js_ledc_stop(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    ledc_channel_t channel;
    bool idle_level = false;
    esp_err_t err;

    (void)this_val;

    if (argc < 1 || js_value_to_channel(ctx, argv[0], &channel) != 0) {
        return JS_ThrowTypeError(ctx, "ledc.stop(channel, idleLevel?) expects a channel index");
    }
    if (argc >= 2 && !JS_IsUndefined(argv[1]) && !JS_IsNull(argv[1]) && js_value_to_bool(ctx, argv[1], &idle_level) != 0) {
        return JS_ThrowTypeError(ctx, "ledc.stop(channel, idleLevel?) expects a boolean-like idle level");
    }

    err = ledc_stop(LEDC_LOW_SPEED_MODE, channel, idle_level ? 1u : 0u);
    if (err != ESP_OK) {
        return ledc_throw_error(ctx, err, "ledc_stop", (int)channel);
    }

    return ledc_make_channel_status(ctx, channel);
}

JSValue js_ledc_timerPause(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    ledc_timer_t timer;
    esp_err_t err;

    (void)this_val;

    if (argc < 1 || js_value_to_timer(ctx, argv[0], &timer) != 0) {
        return JS_ThrowTypeError(ctx, "ledc.timerPause(timer) expects a timer index");
    }

    err = ledc_timer_pause(LEDC_LOW_SPEED_MODE, timer);
    if (err != ESP_OK) {
        return ledc_throw_error(ctx, err, "ledc_timer_pause", (int)timer);
    }

    ledc_timer_state(timer)->configured = true;
    ledc_timer_state(timer)->paused = true;
    return ledc_make_timer_status(ctx, timer);
}

JSValue js_ledc_timerResume(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    ledc_timer_t timer;
    esp_err_t err;

    (void)this_val;

    if (argc < 1 || js_value_to_timer(ctx, argv[0], &timer) != 0) {
        return JS_ThrowTypeError(ctx, "ledc.timerResume(timer) expects a timer index");
    }

    err = ledc_timer_resume(LEDC_LOW_SPEED_MODE, timer);
    if (err != ESP_OK) {
        return ledc_throw_error(ctx, err, "ledc_timer_resume", (int)timer);
    }

    ledc_timer_state(timer)->configured = true;
    ledc_timer_state(timer)->paused = false;
    return ledc_make_timer_status(ctx, timer);
}

JSValue js_ledc_timerStatus(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    ledc_timer_t timer;

    (void)this_val;

    if (argc < 1 || js_value_to_timer(ctx, argv[0], &timer) != 0) {
        return JS_ThrowTypeError(ctx, "ledc.timerStatus(timer) expects a timer index");
    }

    return ledc_make_timer_status(ctx, timer);
}

JSValue js_ledc_channelStatus(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    ledc_channel_t channel;

    (void)this_val;

    if (argc < 1 || js_value_to_channel(ctx, argv[0], &channel) != 0) {
        return JS_ThrowTypeError(ctx, "ledc.channelStatus(channel) expects a channel index");
    }

    return ledc_make_channel_status(ctx, channel);
}

JSValue js_ledc_get_channel_count(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_NewInt32(ctx, SOC_LEDC_CHANNEL_NUM);
}

JSValue js_ledc_get_timer_count(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_NewInt32(ctx, SOC_LEDC_TIMER_NUM);
}

JSValue js_ledc_get_max_duty_resolution_bits(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_NewInt32(ctx, SOC_LEDC_TIMER_BIT_WIDTH);
}

#endif
